app/controllers/posts_controller.rb

  def create
    Post.create(title: params[:posts][:title], description: params[:posts][:description])
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My Post Title"], ["description", "My Post description"], ["created_at", "2017-03-01 02:34:44.799585"], ["updated_at", "2017-03-01 02:34:44.799585"]]